In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
import pandas.util.testing as tm; tm.N=3

In [16]:
def unpivot(frame):
    N, K = frame.shape
    
    data = {'value': frame.values.ravel('F'),
           'variable': np.asarray(frame.columns).repeat(N),
            'date': np.tile(np.asarray(frame.index),K)}
    
    return DataFrame(data, columns=['date','variable','value'])

dframe = unpivot(tm.makeTimeDataFrame())

In [17]:
dframe

         date variable     value
0  2000-01-03        A -0.446813
1  2000-01-04        A  0.121545
2  2000-01-05        A -0.264708
3  2000-01-03        B  0.874463
4  2000-01-04        B -0.016697
5  2000-01-05        B  1.649975
6  2000-01-03        C -0.737132
7  2000-01-04        C -1.859389
8  2000-01-05        C  1.437178
9  2000-01-03        D  0.287647
10 2000-01-04        D -1.289453
11 2000-01-05        D -0.536395

In [19]:
# Here we pivot the data

# The first values passed are the row and column indices

dframe_piv = dframe.pivot('date','variable','value')

dframe_piv

variable           A         B         C         D
date
2000-01-03 -0.446813  0.874463 -0.737132  0.287647
2000-01-04  0.121545 -0.016697 -1.859389 -1.289453
2000-01-05 -0.264708  1.649975  1.437178 -0.536395